## Plan Result (sbox_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;plumclassic&#34;]
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door[0].azurerm_cdn_frontdoor_secret.certificate[&#34;plumclassic&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain["plumclassic"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/plumclassic"
        name                     = "plumclassic"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/secrets/hmcts-sbox-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_secret.certificate["plumclassic"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/secrets/hmcts-sbox-managed-secret" -> (known after apply)
      ~ name                       = "hmcts-sbox-managed-secret" -> "plumclassic-managed-secret" # forces replacement
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ subject_alternative_names = [
                  - "frontdoor.sandbox.platform.hmcts.net",
                ] -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1871,"Program":"tfcmt","SHA1":"","Target":"sbox_global","Vars":{}} -->